cf/Reports/РегистрУчетаОперацийПоДвижениюДебиторскойИКредиторскойЗадолженности.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.9">
	<Report>
		<Properties>
			<Name>РегистрУчетаОперацийПоДвижениюДебиторскойИКредиторскойЗадолженности</Name>
			<Comment>(регл)</Comment>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаНач</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаКон</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПостроительОтчета</Name>
					<Type>
						<v8:Type>cfg:ReportBuilder</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Report>
</MetaDataObject>

cf/AccountingRegisters/Хозрасчетный.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.9">
	<AccountingRegister>
		<Properties>
			<Name>Хозрасчетный</Name>
			<Comment>(Регл)</Comment>
			<ChartOfAccounts>ChartOfAccounts.Хозрасчетный</ChartOfAccounts>
			<Correspondence>true</Correspondence>
		</Properties>
		<ChildObjects>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
					<Balance>true</Balance>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Валюта</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
					<Balance>false</Balance>
					<AccountingFlag>ChartOfAccounts.Хозрасчетный.AccountingFlag.Валютный</AccountingFlag>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Подразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПодразделенияОрганизаций</v8:Type>
					</Type>
					<Balance>false</Balance>
					<AccountingFlag>ChartOfAccounts.Хозрасчетный.AccountingFlag.УчетПоПодразделениям</AccountingFlag>
				</Properties>
			</Dimension>
			<Resource>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
					<Balance>true</Balance>
					<ExtDimensionAccountingFlag>ChartOfAccounts.Хозрасчетный.ExtDimensionAccountingFlag.Суммовой</ExtDimensionAccountingFlag>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ВалютнаяСумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
					<Balance>false</Balance>
					<AccountingFlag>ChartOfAccounts.Хозрасчетный.AccountingFlag.Валютный</AccountingFlag>
					<ExtDimensionAccountingFlag>ChartOfAccounts.Хозрасчетный.ExtDimensionAccountingFlag.Валютный</ExtDimensionAccountingFlag>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Количество</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
					<Balance>false</Balance>
					<AccountingFlag>ChartOfAccounts.Хозрасчетный.AccountingFlag.Количественный</AccountingFlag>
					<ExtDimensionAccountingFlag>ChartOfAccounts.Хозрасчетный.ExtDimensionAccountingFlag.Количественный</ExtDimensionAccountingFlag>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаНУ</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
					<Balance>false</Balance>
					<AccountingFlag>ChartOfAccounts.Хозрасчетный.AccountingFlag.НалоговыйУчет</AccountingFlag>
					<ExtDimensionAccountingFlag>ChartOfAccounts.Хозрасчетный.ExtDimensionAccountingFlag.Суммовой</ExtDimensionAccountingFlag>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаПР</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
					<Balance>false</Balance>
					<AccountingFlag>ChartOfAccounts.Хозрасчетный.AccountingFlag.НалоговыйУчет</AccountingFlag>
					<ExtDimensionAccountingFlag>ChartOfAccounts.Хозрасчетный.ExtDimensionAccountingFlag.Суммовой</ExtDimensionAccountingFlag>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаВР</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
					<Balance>false</Balance>
					<AccountingFlag>ChartOfAccounts.Хозрасчетный.AccountingFlag.НалоговыйУчет</AccountingFlag>
					<ExtDimensionAccountingFlag>ChartOfAccounts.Хозрасчетный.ExtDimensionAccountingFlag.Суммовой</ExtDimensionAccountingFlag>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>Содержание</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НеКорректироватьСтоимостьАвтоматически</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</AccountingRegister>
</MetaDataObject>

cf/Enums/ВидыПрочихДоходовИРасходов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.9">
	<Enum>
		<Properties>
			<Name>ВидыПрочихДоходовИРасходов</Name>
			<Comment>(Общ)</Comment>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ВозмещениеУбытковКПолучениюУплате</Name>
					<Comment>(Общ)</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ДолевоеУчастиеВИностранныхОрганизациях</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ДолевоеУчастиеВРоссийскихОрганизациях</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ДоходыРасходыПоОперациямСФинансовымиИнструментамиСрочныхСделок</Name>
					<Comment>(Общ)</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ДоходыРасходыПоОперациямСФинансовымиИнструментамиСрочныхСделокОР</Name>
					<Comment>(Общ)</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ДоходыРасходыСвязанныеСБезвозмезднымПолучениемИмущества</Name>
					<Comment>(Общ)</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ДоходыРасходыСвязанныеСЛиквидациейОсновныхСредств</Name>
					<Comment>(Общ)</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ДоходыРасходыСвязанныеСоСдачейИмуществаВАренду</Name>
					<Comment>(Общ)</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ДоходыРасходыСвязанныеСПереоценкойВнеоборотныхАктивов</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ДоходыРасходыСвязанныеСРеализациейИмущественныхПравКромеПраваТребования</Name>
					<Comment>(Общ)</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ДоходыРасходыСвязанныеСРеализациейИмущественныхПравПоОбъектамОбслуживающихПроизводств</Name>
					<Comment>(Общ)</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ДоходыРасходыСвязанныеСРеализациейНематериальныхАктивов</Name>
					<Comment>(Общ)</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ДоходыРасходыСвязанныеСРеализациейОбъектовСтроительства</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ДоходыРасходыСвязанныеСРеализациейОсновныхСредств</Name>
					<Comment>(Общ)</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ДоходыРасходыСвязанныеСРеализациейПраваТребованияДоНаступленияСрокаПлатежа</Name>
					<Comment>(Общ)</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ДоходыРасходыСвязанныеСРеализациейПраваТребованияКакОказанияФинансовыхУслуг</Name>
					<Comment>(Общ)</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ДоходыРасходыСвязанныеСРеализациейПраваТребованияПослеНаступленияСрокаПлатежа</Name>
					<Comment>(Общ)</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ДоходыРасходыСвязанныеСРеализациейПрочегоИмущества</Name>
					<Comment>(Общ)</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ДоходыРасходыСвязанныеСРеализациейЦенныхБумаг</Name>
					<Comment>(Общ)</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ДоходыРасходыСвязанныеСУчастиемВДругихОрганизациях</Name>
					<Comment>(Общ)</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ДоходыСвязанныеСВосстановлениемАмортизационнойПремии</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>КурсовыеРазницы</Name>
					<Comment>(Общ)</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>КурсовыеРазницыПоРасчетамВУЕ</Name>
					<Comment>Курсовые разницы по расчетам в у.е.</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НалогиИСборы</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НДСПоСписаннойКредиторскойЗадолженности</Name>
					<Comment>(Общ)</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОтчисленияВОценочныеРезервы</Name>
					<Comment>(Общ)</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПремияПокупателю</Name>
					<Comment>Премия, выплаченная покупателю</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПрибыльУбытокПрошлыхЛет</Name>
					<Comment>(Общ)</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПроцентыКПолучениюУплате</Name>
					<Comment>(Общ)</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПроцентыНачисленныеПоСт269</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПроцентыПоГосударственнымЦеннымБумагам</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПроцентыПоГосударственнымЦеннымБумагамПоСтавке0</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПрочиеВнереализационныеДоходыРасходы</Name>
					<Comment>(Общ)</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПрочиеКосвенныеРасходы</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПрочиеОперационныеДоходыРасходы</Name>
					<Comment>(Общ)</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>РазницаМеждуПервоначальнойИНоминальнойСтоимостьюПоДолговымЦеннымБумагам</Name>
					<Comment>(Общ)</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>РасходыНаУслугиБанков</Name>
					<Comment>(Общ)</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>РасходыОтСниженияСтоимостиАктивов</Name>
					<Comment>(Общ)</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>РасходыПоПередачеТоваровБезвозмездноИДляСобственныхНужд</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СписаниеДебиторскойКредиторскойЗадолженности</Name>
					<Comment>(Общ)</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>УдалитьПрочиеВнереализационныеРасходы</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>УдалитьПрочиеРасходы</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ШтрафыПениНеустойкиКПолучениюУплате</Name>
					<Comment>(Общ)</Comment>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

cf/Reports/РегистрУчетаОперацийПоДвижениюДебиторскойИКредиторскойЗадолженности/Ext/ObjectModule.bsl
#Если Клиент Тогда
	
Перем НП Экспорт;
Перем мВалютаРегламентированногоУчета Экспорт;

Функция СчетПринадлежит(СчетВладелец, Счет)
	Если Счет = NULL Тогда
		Возврат Ложь;
	КонецЕсли;
	
	Если Счет.ПринадлежитЭлементу(СчетВладелец) ИЛИ Счет = СчетВладелец Тогда
		Возврат Истина;
	Иначе
		Возврат Ложь;
	КонецЕсли;
	
КонецФункции


Функция НаименованиеОперации(Выборка)
	НаименованиеОперации = "";
	
	Если Выборка.СуммаОборотДт <> 0 Тогда
		Если СчетПринадлежит(ПланыСчетов.Хозрасчетный.КраткосрочныеКредиты, Выборка.Счет) ИЛИ
			СчетПринадлежит(ПланыСчетов.Хозрасчетный.КраткосрочныеКредитыВал, Выборка.Счет) ИЛИ
			СчетПринадлежит(ПланыСчетов.Хозрасчетный.ДолгосрочныеКредиты, Выборка.Счет) ИЛИ
			СчетПринадлежит(ПланыСчетов.Хозрасчетный.ДолгосрочныеКредитыВал, Выборка.Счет) Тогда
					
			НаименованиеОперации = "Возврат кредита";
			Если СчетПринадлежит(ПланыСчетов.Хозрасчетный.ПрочиеДоходы, Выборка.КорСчет) Тогда
				Если Выборка.КорСубконто1.ВидПрочихДоходовИРасходов = Перечисления.ВидыПрочихДоходовИРасходов.СписаниеДебиторскойКредиторскойЗадолженности Тогда
					НаименованиеОперации = "Списание долга по кредиту";
				КонецЕсли;
			КонецЕсли;
			
		ИначеЕсли СчетПринадлежит(ПланыСчетов.Хозрасчетный.ПроцентыПоКраткосрочнымКредитам, Выборка.Счет) ИЛИ
			СчетПринадлежит(ПланыСчетов.Хозрасчетный.ПроцентыПоКраткосрочнымКредитамВал, Выборка.Счет) ИЛИ
			СчетПринадлежит(ПланыСчетов.Хозрасчетный.ПроцентыПоДолгосрочнымКредитам, Выборка.Счет) ИЛИ
			СчетПринадлежит(ПланыСчетов.Хозрасчетный.ПроцентыПоДолгосрочнымКредитамВал, Выборка.Счет) Тогда
			
			НаименованиеОперации = "Уплата процентов по кредиту";
			Если СчетПринадлежит(ПланыСчетов.Хозрасчетный.ПрочиеДоходы, Выборка.КорСчет) Тогда
				Если Выборка.КорСубконто1.ВидПрочихДоходовИРасходов = Перечисления.ВидыПрочихДоходовИРасходов.СписаниеДебиторскойКредиторскойЗадолженности Тогда
					НаименованиеОперации = "Списание процентов по кредиту";
				КонецЕсли;
			КонецЕсли;
			
		ИначеЕсли СчетПринадлежит(ПланыСчетов.Хозрасчетный.КраткосрочныеЗаймы, Выборка.Счет) ИЛИ
			СчетПринадлежит(ПланыСчетов.Хозрасчетный.КраткосрочныеЗаймыВал, Выборка.Счет) ИЛИ
			СчетПринадлежит(ПланыСчетов.Хозрасчетный.ДолгосрочныеЗаймы, Выборка.Счет) ИЛИ
			СчетПринадлежит(ПланыСчетов.Хозрасчетный.ДолгосрочныеЗаймыВал, Выборка.Счет) Тогда
			
			НаименованиеОперации = "Возврат займа";
			Если СчетПринадлежит(ПланыСчетов.Хозрасчетный.ПрочиеДоходы, Выборка.КорСчет) Тогда
				Если Выборка.КорСубконто1.ВидПрочихДоходовИРасходов = Перечисления.ВидыПрочихДоходовИРасходов.СписаниеДебиторскойКредиторскойЗадолженности Тогда
					НаименованиеОперации = "Списание долга по займу";
				КонецЕсли;
			КонецЕсли;
			
		ИначеЕсли СчетПринадлежит(ПланыСчетов.Хозрасчетный.ПроцентыПоКраткосрочнымЗаймам, Выборка.Счет) ИЛИ
			СчетПринадлежит(ПланыСчетов.Хозрасчетный.ПроцентыПоКраткосрочнымЗаймамВал, Выборка.Счет) ИЛИ
			СчетПринадлежит(ПланыСчетов.Хозрасчетный.ПроцентыПоДолгосрочнымЗаймам, Выборка.Счет) ИЛИ
			СчетПринадлежит(ПланыСчетов.Хозрасчетный.ПроцентыПоДолгосрочнымЗаймамВал, Выборка.Счет) Тогда
			
			НаименованиеОперации = "Уплата процентов по займу";
			Если СчетПринадлежит(ПланыСчетов.Хозрасчетный.ПрочиеДоходы, Выборка.КорСчет) Тогда
				Если Выборка.КорСубконто1.ВидПрочихДоходовИРасходов = Перечисления.ВидыПрочихДоходовИРасходов.СписаниеДебиторскойКредиторскойЗадолженности Тогда
					НаименованиеОперации = "Списание процентов по займу";
				КонецЕсли;
			КонецЕсли;
			
		ИначеЕсли СчетПринадлежит(ПланыСчетов.Хозрасчетный.Касса, Выборка.КорСчет) ИЛИ
			СчетПринадлежит(ПланыСчетов.Хозрасчетный.РасчетныеСчета, Выборка.КорСчет) ИЛИ
			СчетПринадлежит(ПланыСчетов.Хозрасчетный.ВалютныеСчета, Выборка.КорСчет) ИЛИ
			СчетПринадлежит(ПланыСчетов.Хозрасчетный.СпециальныеСчета, Выборка.КорСчет) Тогда
			
			НаименованиеОперации = "Платеж";
			
		ИначеЕсли СчетПринадлежит(ПланыСчетов.Хозрасчетный.КраткосрочныеКредиты, Выборка.КорСчет) ИЛИ
			СчетПринадлежит(ПланыСчетов.Хозрасчетный.КраткосрочныеКредитыВал, Выборка.КорСчет) ИЛИ
			СчетПринадлежит(ПланыСчетов.Хозрасчетный.ДолгосрочныеКредиты, Выборка.КорСчет) ИЛИ
			СчетПринадлежит(ПланыСчетов.Хозрасчетный.ДолгосрочныеКредитыВал, Выборка.КорСчет) Тогда
					
			НаименованиеОперации = "Получение кредита";
			
		ИначеЕсли СчетПринадлежит(ПланыСчетов.Хозрасчетный.ПроцентыПоКраткосрочнымКредитам, Выборка.КорСчет) ИЛИ
			СчетПринадлежит(ПланыСчетов.Хозрасчетный.ПроцентыПоКраткосрочнымКредитамВал, Выборка.КорСчет) ИЛИ
			СчетПринадлежит(ПланыСчетов.Хозрасчетный.ПроцентыПоДолгосрочнымКредитам, Выборка.КорСчет) ИЛИ
			СчетПринадлежит(ПланыСчетов.Хозрасчетный.ПроцентыПоДолгосрочнымКредитамВал, Выборка.КорСчет) Тогда
			
			НаименованиеОперации = "Начисление процентов по кредиту";
			
		ИначеЕсли СчетПринадлежит(ПланыСчетов.Хозрасчетный.КраткосрочныеЗаймы, Выборка.КорСчет) ИЛИ
			СчетПринадлежит(ПланыСчетов.Хозрасчетный.КраткосрочныеЗаймыВал, Выборка.КорСчет) ИЛИ
			СчетПринадлежит(ПланыСчетов.Хозрасчетный.ДолгосрочныеЗаймы, Выборка.КорСчет) ИЛИ
			СчетПринадлежит(ПланыСчетов.Хозрасчетный.ДолгосрочныеЗаймыВал, Выборка.КорСчет) Тогда
			
			НаименованиеОперации = "Получение займа";
			
		ИначеЕсли СчетПринадлежит(ПланыСчетов.Хозрасчетный.ПроцентыПоКраткосрочнымЗаймам, Выборка.КорСчет) ИЛИ
			СчетПринадлежит(ПланыСчетов.Хозрасчетный.ПроцентыПоКраткосрочнымЗаймамВал, Выборка.КорСчет) ИЛИ
			СчетПринадлежит(ПланыСчетов.Хозрасчетный.ПроцентыПоДолгосрочнымЗаймам, Выборка.КорСчет) ИЛИ
			СчетПринадлежит(ПланыСчетов.Хозрасчетный.ПроцентыПоДолгосрочнымЗаймамВал, Выборка.КорСчет) Тогда
			
			НаименованиеОперации = "Начисление процентов по займу";

		ИначеЕсли СчетПринадлежит(ПланыСчетов.Хозрасчетный.Продажи, Выборка.КорСчет) Тогда
			Если НЕ ЗначениеЗаполнено(Выборка.КорСубконто1) Тогда
				НаименованиеОперации = "Реализация";
			Иначе
				НаименованиеОперации = "Реализация (" + Выборка.КорСубконто1 + ")";
			КонецЕсли;
			
		ИначеЕсли СчетПринадлежит(ПланыСчетов.Хозрасчетный.ПрочиеДоходы, Выборка.КорСчет) Тогда
			НаименованиеОперации = Выборка.КорСубконто1;
			
		Иначе
			НаименованиеОперации = Выборка.Содержание;
			
		КонецЕсли;
	Иначе
		Если СчетПринадлежит(ПланыСчетов.Хозрасчетный.КраткосрочныеКредиты, Выборка.Счет) ИЛИ
			СчетПринадлежит(ПланыСчетов.Хозрасчетный.КраткосрочныеКредитыВал, Выборка.Счет) ИЛИ
			СчетПринадлежит(ПланыСчетов.Хозрасчетный.ДолгосрочныеКредиты, Выборка.Счет) ИЛИ
			СчетПринадлежит(ПланыСчетов.Хозрасчетный.ДолгосрочныеКредитыВал, Выборка.Счет) Тогда
					
			НаименованиеОперации = "Получение кредита";
			
		ИначеЕсли СчетПринадлежит(ПланыСчетов.Хозрасчетный.ПроцентыПоКраткосрочнымКредитам, Выборка.Счет) ИЛИ
			СчетПринадлежит(ПланыСчетов.Хозрасчетный.ПроцентыПоКраткосрочнымКредитамВал, Выборка.Счет) ИЛИ
			СчетПринадлежит(ПланыСчетов.Хозрасчетный.ПроцентыПоДолгосрочнымКредитам, Выборка.Счет) ИЛИ
			СчетПринадлежит(ПланыСчетов.Хозрасчетный.ПроцентыПоДолгосрочнымКредитамВал, Выборка.Счет) Тогда
			
			НаименованиеОперации = "Начисление процентов по кредиту";
						
		ИначеЕсли СчетПринадлежит(ПланыСчетов.Хозрасчетный.КраткосрочныеЗаймы, Выборка.Счет) ИЛИ
			СчетПринадлежит(ПланыСчетов.Хозрасчетный.КраткосрочныеЗаймыВал, Выборка.Счет) ИЛИ
			СчетПринадлежит(ПланыСчетов.Хозрасчетный.ДолгосрочныеЗаймы, Выборка.Счет) ИЛИ
			СчетПринадлежит(ПланыСчетов.Хозрасчетный.ДолгосрочныеЗаймыВал, Выборка.Счет) Тогда
			
			НаименованиеОперации = "Получение займа";
						
		ИначеЕсли СчетПринадлежит(ПланыСчетов.Хозрасчетный.ПроцентыПоКраткосрочнымЗаймам, Выборка.Счет) ИЛИ
			СчетПринадлежит(ПланыСчетов.Хозрасчетный.ПроцентыПоКраткосрочнымЗаймамВал, Выборка.Счет) ИЛИ
			СчетПринадлежит(ПланыСчетов.Хозрасчетный.ПроцентыПоДолгосрочнымЗаймам, Выборка.Счет) ИЛИ
			СчетПринадлежит(ПланыСчетов.Хозрасчетный.ПроцентыПоДолгосрочнымЗаймамВал, Выборка.Счет) Тогда
			
			НаименованиеОперации = "Начисление процентов по займу";
			
		ИначеЕсли Число(СокрЛП(Лев(Выборка.КорСчет.Код, 2))) <= 45 ИЛИ
			СчетПринадлежит(ПланыСчетов.Хозрасчетный.РасходыБудущихПериодов, Выборка.КорСчет) Тогда
			
			НаименованиеОперации = "Приобретение";
			
		ИначеЕсли СчетПринадлежит(ПланыСчетов.Хозрасчетный.ПрочиеРасходы, Выборка.КорСчет) Тогда
			НаименованиеОперации = Выборка.КорСубконто1;
			
        ИначеЕсли СчетПринадлежит(ПланыСчетов.Хозрасчетный.Касса, Выборка.КорСчет) ИЛИ
			СчетПринадлежит(ПланыСчетов.Хозрасчетный.РасчетныеСчета, Выборка.КорСчет) ИЛИ
			СчетПринадлежит(ПланыСчетов.Хозрасчетный.ВалютныеСчета, Выборка.КорСчет) ИЛИ
			СчетПринадлежит(ПланыСчетов.Хозрасчетный.СпециальныеСчета, Выборка.КорСчет) Тогда
			
			НаименованиеОперации = "Получение денежных средств";
			
		ИначеЕсли СчетПринадлежит(ПланыСчетов.Хозрасчетный.Паи, Выборка.КорСчет) Тогда
			НаименованиеОперации = "Приобретение долей в УК";
			
		ИначеЕсли СчетПринадлежит(ПланыСчетов.Хозрасчетный.Акции, Выборка.КорСчет) Тогда
			НаименованиеОперации = "Приобретение акций в УК";
			
		ИначеЕсли СчетПринадлежит(ПланыСчетов.Хозрасчетный.ДолговыеЦенныеБумаги, Выборка.КорСчет) Тогда
			НаименованиеОперации = "Получение ценных бумаг";
			
		ИначеЕсли СчетПринадлежит(ПланыСчетов.Хозрасчетный.ПредоставленныеЗаймы, Выборка.КорСчет) Тогда
			НаименованиеОперации = "Предоставлен займ";
			
		ИначеЕсли СчетПринадлежит(ПланыСчетов.Хозрасчетный.ВкладыПоДоговоруПростогоТоварищества, Выборка.КорСчет) Тогда
			НаименованиеОперации = "Вклад в простое товарищество";
			
		ИначеЕсли СчетПринадлежит(ПланыСчетов.Хозрасчетный.ПриобретенныеПрава, Выборка.КорСчет) Тогда
			НаименованиеОперации = "Приобретение прав";

        Иначе
			
			НаименованиеОперации = Выборка.Содержание;
			
		КонецЕсли;
	КонецЕсли;
	
	
	Возврат НаименованиеОперации;
КонецФункции

// Выполняет запрос и формирует табличный документ-результат отчета
// в соответствии с настройками, заданными значениями реквизитов отчета.
//
// Параметры:
//	ДокументРезультат - табличный документ, формируемый отчетом
//	ПоказыватьЗаголовок - признак видимости строк с заголовком отчета
//	ВысотаЗаголовка - параметр, через который возвращается высота заголовка в строках 
//
Процедура СформироватьОтчет(ДокументРезультат, ПоказыватьЗаголовок, ВысотаЗаголовка, ТолькоЗаголовок = Ложь) Экспорт
	
	НачалоПериода = НачалоДня(ДатаНач);
	КонецПериода = КонецДня(ДатаКон);
	
	ДокументРезультат.Очистить();

	Макет = ПолучитьМакет("Отчет");
    МакетОбщий = ПолучитьОбщийМакет("СправкаРасчет");
	
	ОбластьЗаголовок  = Макет.ПолучитьОбласть("Заголовок");

	ОбластьЗаголовок.Параметры.НачалоПериода       = Формат(НачалоПериода, "ДФ=dd.MM.yyyy");
	ОбластьЗаголовок.Параметры.КонецПериода        = Формат(КонецПериода, "ДФ=dd.MM.yyyy");
	СведенияОбОрганизации = УправлениеКонтактнойИнформацией.СведенияОЮрФизЛице(Организация);
	НазваниеОрганизации = ФормированиеПечатныхФорм.ОписаниеОрганизации(СведенияОбОрганизации, "НаименованиеДляПечатныхФорм");
	ОбластьЗаголовок.Параметры.НазваниеОрганизации = НазваниеОрганизации;
	ОбластьЗаголовок.Параметры.ИННОрганизации      = "" + Организация.ИНН + " / " + Организация.КПП;
	ДокументРезультат.Вывести(ОбластьЗаголовок);

	// Параметр для показа заголовка
	ВысотаЗаголовка = ДокументРезультат.ВысотаТаблицы;

	// Когда нужен только заголовок:
	Если ТолькоЗаголовок Тогда
		Возврат;
	КонецЕсли;
	
	// Проверим заполнение обязательных реквизитов
	Если НалоговыйУчет.ПроверитьЗаполнениеОбязательныхРеквизитов(ДатаНач,ДатаКон,Организация) Тогда
		Возврат;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ВысотаЗаголовка) Тогда
		ДокументРезультат.Область("R1:R" + ВысотаЗаголовка).Видимость = ПоказыватьЗаголовок;
	КонецЕсли;
	
	СчетаЗадолженности = Новый Массив;
	СчетаЗадолженности.Добавить(ПланыСчетов.Хозрасчетный.РасчетыСПоставщикамиИПодрядчиками);
	СчетаЗадолженности.Добавить(ПланыСчетов.Хозрасчетный.РасчетыСПокупателямиИЗаказчиками);
	СчетаЗадолженности.Добавить(ПланыСчетов.Хозрасчетный.РасчетыПоКраткосрочнымКредитамИЗаймам);
	СчетаЗадолженности.Добавить(ПланыСчетов.Хозрасчетный.РасчетыПоДолгосрочнымКредитамИЗаймам);
	СчетаЗадолженности.Добавить(ПланыСчетов.Хозрасчетный.РасчетыСРазнымиДебиторамиИКредиторами);
	
	ИсключитьСчета = Новый Массив;
	ИсключитьСчета.Добавить(ПланыСчетов.Хозрасчетный.НДСпоАвансамИПредоплатам);
	ИсключитьСчета.Добавить(ПланыСчетов.Хозрасчетный.РасчетыПоНДСотложенномуДляУплатыВБюджет);
	
	ВидыСубконто = Новый Массив;
	ВидыСубконто.Добавить(ПланыВидовХарактеристик.ВидыСубконтоХозрасчетные.Контрагенты);
	ВидыСубконто.Добавить(ПланыВидовХарактеристик.ВидыСубконтоХозрасчетные.Договоры);
	
	ВидыКорСубконто = Новый Массив;
	ВидыКорСубконто.Добавить(ПланыВидовХарактеристик.ВидыСубконтоХозрасчетные.НоменклатурныеГруппы);
	ВидыКорСубконто.Добавить(ПланыВидовХарактеристик.ВидыСубконтоХозрасчетные.ПрочиеДоходыИРасходы);
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ДатаНач", НачалоПериода);
	Запрос.УстановитьПараметр("ДатаКон", КонецПериода);
	Запрос.УстановитьПараметр("Организация",  Организация);
	Запрос.УстановитьПараметр("СчетаЗадолженности",  СчетаЗадолженности);
	Запрос.УстановитьПараметр("ВидыСубконто",  ВидыСубконто);
	Запрос.УстановитьПараметр("ИсключитьСчета",  ИсключитьСчета);
	Запрос.УстановитьПараметр("Счет008",  ПланыСчетов.Хозрасчетный.ОбеспеченияОбязательствПолученные);
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	Хозрасчетный.Регистратор КАК Регистратор,
	|	Хозрасчетный.Содержание,
	|	НАЧАЛОПЕРИОДА(ХозрасчетныйОбороты.Период, ДЕНЬ) КАК ДатаОперации,
	|	ХозрасчетныйОбороты.Счет КАК Счет,
	|	ХозрасчетныйОбороты.Субконто1 КАК Субконто1,
	|	ХозрасчетныйОбороты.Субконто2 КАК Субконто2,
	|	ХозрасчетныйОбороты.КорСчет КАК КорСчет,
	|	ХозрасчетныйОбороты.КорСубконто1 КАК КорСубконто1,
	|	СУММА(ХозрасчетныйОбороты.СуммаОборотДт) КАК СуммаОборотДт,
	|	СУММА(ХозрасчетныйОбороты.СуммаОборотКт) КАК СуммаОборотКт,
	|	СУММА(0) КАК СуммаОстатокДт,
	|	СУММА(0) КАК СуммаОстатокКт,
	|	СУММА(0) КАК Обеспечение
	|ИЗ
	|	РегистрБухгалтерии.Хозрасчетный.Обороты(&ДатаНач, &ДатаКон, Запись, Счет В ИЕРАРХИИ (&СчетаЗадолженности), &ВидыСубконто, Организация = &Организация, , ) КАК ХозрасчетныйОбороты
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрБухгалтерии.Хозрасчетный КАК Хозрасчетный
	|		ПО ХозрасчетныйОбороты.Регистратор = Хозрасчетный.Регистратор
	|			И ХозрасчетныйОбороты.НомерСтроки = Хозрасчетный.НомерСтроки
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрБухгалтерии.Хозрасчетный.Остатки(&ДатаКон, Счет = &Счет008, , Организация = &Организация) КАК Остатки008
	|		ПО ХозрасчетныйОбороты.Субконто2 = Остатки008.Субконто2
	|ГДЕ
	|	(НЕ ХозрасчетныйОбороты.Счет В ИЕРАРХИИ (&ИсключитьСчета))
	|
	|СГРУППИРОВАТЬ ПО
	|	ХозрасчетныйОбороты.КорСчет,
	|	ХозрасчетныйОбороты.КорСубконто1,
	|	ХозрасчетныйОбороты.Счет,
	|	ХозрасчетныйОбороты.Субконто1,
	|	ХозрасчетныйОбороты.Субконто2,
	|	Хозрасчетный.Регистратор,
	|	Хозрасчетный.Содержание,
	|	НАЧАЛОПЕРИОДА(ХозрасчетныйОбороты.Период, ДЕНЬ)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	NULL,
	|	NULL,
	|	NULL,
	|	ХозрасчетныйОстатки.Счет,
	|	ХозрасчетныйОстатки.Субконто1,
	|	ХозрасчетныйОстатки.Субконто2,
	|	NULL,
	|	NULL,
	|	СУММА(0),
	|	СУММА(0),
	|	СУММА(ХозрасчетныйОстатки.СуммаОстатокДт),
	|	СУММА(ХозрасчетныйОстатки.СуммаОстатокКт),
	|	СУММА(0)
	|ИЗ
	|	РегистрБухгалтерии.Хозрасчетный.Остатки(&ДатаНач, Счет В ИЕРАРХИИ (&СчетаЗадолженности), &ВидыСубконто, Организация = &Организация) КАК ХозрасчетныйОстатки
	|ГДЕ
	|	(НЕ ХозрасчетныйОстатки.Счет В ИЕРАРХИИ (&ИсключитьСчета))
	|
	|СГРУППИРОВАТЬ ПО
	|	ХозрасчетныйОстатки.Счет,
	|	ХозрасчетныйОстатки.Субконто1,
	|	ХозрасчетныйОстатки.Субконто2
	|
	|ОБЪЕДИНИТЬ
	|
	|ВЫБРАТЬ
	|	NULL,
	|	NULL,
	|	NULL,
	|	NULL,
	|	ХозрасчетныйОстатки.Субконто1,
	|	ХозрасчетныйОстатки.Субконто2,
	|	NULL,
	|	NULL,
	|	СУММА(0),
	|	СУММА(0),
	|	СУММА(0),
	|	СУММА(0),
	|	СУММА(ХозрасчетныйОстатки.СуммаОстатокДт)
	|ИЗ
	|	РегистрБухгалтерии.Хозрасчетный.Остатки(&ДатаКон, Счет = &Счет008, , Организация = &Организация) КАК ХозрасчетныйОстатки
	|
	|СГРУППИРОВАТЬ ПО
	|	ХозрасчетныйОстатки.Субконто1,
	|	ХозрасчетныйОстатки.Субконто2
	|
	|УПОРЯДОЧИТЬ ПО
	|	ДатаОперации,
	|	Счет,
	|	Субконто1,
	|	Субконто2,
	|	КорСчет,
	|	КорСубконто1,
	|	Регистратор
	|ИТОГИ ПО
	|	Субконто2";
	
	ОграниченияПоПостроителюОтчета = СтандартныеОтчеты.ПолучитьТекстОграниченийПоПостроителюОтчета(ПостроительОтчета, Запрос);
	
	СтрОтбор = УправлениеОтчетами.СформироватьСтрокуОтборов(ПостроительОтчета.Отбор);
	Если Не ПустаяСтрока(СтрОтбор) Тогда
		ОбластьОтбор = МакетОбщий.ПолучитьОбласть("СтрокаОтбор");                     
		ОбластьОтбор.Параметры.ТекстПроОтбор = "Отбор: " + СтрОтбор;
		ДокументРезультат.Вывести(ОбластьОтбор);
	   Запрос.Текст = СтрЗаменить(Запрос.Текст, "Организация = &Организация", "Организация = &Организация И " + ОграниченияПоПостроителюОтчета);
		
	КонецЕсли;	
	
	Результат = Запрос.Выполнить();
	
	ОбластьШапкаТаблицы  = Макет.ПолучитьОбласть("ШапкаТаблицы");
	ОбластьОбъектУчета	 = Макет.ПолучитьОбласть("ОбъектУчета");
	ОбластьСтрока        = Макет.ПолучитьОбласть("Строка");
	ОбластьПодвал        = Макет.ПолучитьОбласть("Подвал");
    ДокументРезультат.Вывести(ОбластьШапкаТаблицы);
	
    //Выборка результатов запроса
	
	ВыборкаДоговоров = Результат.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	Пока ВыборкаДоговоров.Следующий() Цикл
		СальдоПоДоговору = ВыборкаДоговоров.СуммаОстатокДт - ВыборкаДоговоров.СуммаОстатокКт;
		ОбластьОбъектУчета.Параметры.ОбеспеченностьЗалогом = ВыборкаДоговоров.Обеспечение;
		ОбластьОбъектУчета.Параметры.РеквизитыДоговора = "" + ВыборкаДоговоров.Субконто2.Владелец.НаименованиеПолное + 
		", " + ВыборкаДоговоров.Субконто2;
		ОбластьОбъектУчета.Параметры.ПорядокРасчетов = "Цены в договоре указаны в " + ВыборкаДоговоров.Субконто2.ВалютаВзаиморасчетов + 
		", " + БухгалтерскийУчетРасчетовСКонтрагентами.ОпределениеВидаРасчетовПоПараметрамДоговора(ВыборкаДоговоров.Субконто2, мВалютаРегламентированногоУчета);
		ДокументРезультат.Вывести(ОбластьОбъектУчета);

		ВыборкаЗаписей = ВыборкаДоговоров.Выбрать();
		Пока ВыборкаЗаписей.Следующий() Цикл
			Если ВыборкаЗаписей.Счет = Null Тогда
				Продолжить;
			КонецЕсли;
			Если ВыборкаЗаписей.СуммаОборотДт = 0 И ВыборкаЗаписей.СуммаОборотКт = 0 Тогда
				Продолжить;
			КонецЕсли;
			СальдоПоДоговору = СальдоПоДоговору + ВыборкаЗаписей.СуммаОборотДт - ВыборкаЗаписей.СуммаОборотКт;
			ОбластьСтрока.Параметры.ДатаОперации = ВыборкаЗаписей.ДатаОперации;
			
			ОбластьСтрока.Параметры.ОснованиеОперации = "" + Формат(ВыборкаЗаписей.Регистратор.Дата, "ДФ=dd.MM.yyyy") + ", №"+ ВыборкаЗаписей.Регистратор.Номер;
			ОбластьСтрока.Параметры.Расшифровка = ВыборкаЗаписей.Регистратор;
			ОбластьСтрока.Параметры.ОборотПоДебету = ВыборкаЗаписей.СуммаОборотДт;
			ОбластьСтрока.Параметры.ОборотПоКредиту = ВыборкаЗаписей.СуммаОборотКт;
			
			Если Лев(ВыборкаЗаписей.КорСчет, 2) = "91" Тогда
				Если ВыборкаЗаписей.КорСубконто1.ВидПрочихДоходовИРасходов = Перечисления.ВидыПрочихДоходовИРасходов.КурсовыеРазницы 
					Или ВыборкаЗаписей.КорСубконто1.ВидПрочихДоходовИРасходов = Перечисления.ВидыПрочихДоходовИРасходов.КурсовыеРазницыПоРасчетамВУЕ Тогда
					НаименованиеОперации = "Курсовая разница";
					ОбластьСтрока.Параметры.СуммаКурсовыхРазницПоДебету = ВыборкаЗаписей.СуммаОборотДт;
					ОбластьСтрока.Параметры.СуммаКурсовыхРазницПоКредиту = ВыборкаЗаписей.СуммаОборотКт;
				Иначе
					НаименованиеОперации = НаименованиеОперации(ВыборкаЗаписей);
					ОбластьСтрока.Параметры.СуммаКурсовыхРазницПоДебету = "";
					ОбластьСтрока.Параметры.СуммаКурсовыхРазницПоКредиту = "";
				КонецЕсли;
			Иначе
				НаименованиеОперации = НаименованиеОперации(ВыборкаЗаписей);
				ОбластьСтрока.Параметры.СуммаКурсовыхРазницПоДебету = "";
				ОбластьСтрока.Параметры.СуммаКурсовыхРазницПоКредиту = "";
			КонецЕсли;
            ОбластьСтрока.Параметры.НаименованиеОперации = НаименованиеОперации;
			Если СальдоПоДоговору > 0 Тогда
				ОбластьСтрока.Параметры.СальдоДебетовое = СальдоПоДоговору;
				ОбластьСтрока.Параметры.СальдоКредитовое = 0;
			Иначе
				ОбластьСтрока.Параметры.СальдоДебетовое = 0;
				ОбластьСтрока.Параметры.СальдоКредитовое = - СальдоПоДоговору;
			КонецЕсли;
			ДокументРезультат.Вывести(ОбластьСтрока);
		КонецЦикла;
	КонецЦикла;
		
		
	СтруктураЛиц = РегламентированнаяОтчетность.ОтветственныеЛицаОрганизаций(Организация, ДатаКон);
	ОбластьПодвал.Параметры.ОтветственныйЗаРегистры = СтруктураЛиц.ОтветственныйЗаРегистры;
	ДокументРезультат.Вывести(ОбластьПодвал);
	
КонецПроцедуры // СформироватьОтчет

Процедура ЗаполнитьНачальныеНастройки() Экспорт
	
	СтарыеНастройки = УправлениеОтчетами.ПолучитьКопиюОтбораВТЗ(ПостроительОтчета.Отбор);
	
	СоотвСубконто = Новый Соответствие;
	
	Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ОстаткиИОбороты.СуммаОборот КАК СуммаОборот,
	|	ОстаткиИОбороты.Субконто2
	|{ВЫБРАТЬ
	|	Субконто2.*}
	|ИЗ
	|	РегистрБухгалтерии.Хозрасчетный.ОстаткиИОбороты(, , МЕСЯЦ, , Счет В ИЕРАРХИИ (&Счет), , {(Субконто2).*}) КАК ОстаткиИОбороты
	|ИТОГИ
	|	СУММА(СуммаОборот)
	|ПО
	|	ОБЩИЕ
	|{ИТОГИ ПО
	|	Субконто2.*}";

Массив = Новый Массив;
Массив.Добавить(ПланыСчетов.Хозрасчетный.ПрочиеРасчетыСРазнымиДебиторамиИКредиторами);
ПостроительОтчета.Параметры.Вставить("Счет", Массив);
ПостроительОтчета.Параметры.Вставить("ПустаяОрганизация", Справочники.Организации.ПустаяСсылка());
	
ПостроительОтчета.Текст = Текст;

СоотвСубконто = Новый Соответствие;
СоотвСубконто.Вставить("Субконто2",    ПланыВидовХарактеристик.ВидыСубконтоХозрасчетные.Договоры);


	Сч = 0;
	Для каждого Элемент Из СоотвСубконто Цикл
		Сч = Сч+1;
		Поле = ПостроительОтчета.ДоступныеПоля.Найти(Элемент.Ключ);
		Поле.ТипЗначения = Элемент.Значение.ТипЗначения;
		Поле.Представление = Элемент.Значение.Наименование;
		
		ПостроительОтчета.Отбор.Добавить(Элемент.Ключ);
	КонецЦикла;


УправлениеОтчетами.УстановитьОтборИзТаблицы(ПостроительОтчета.Отбор, СтарыеНастройки);

КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// ОПЕРАТОРЫ ОСНОВНОЙ ПРОГРАММЫ
// 

НП           = Новый НастройкаПериода;
мВалютаРегламентированногоУчета = Константы.ВалютаРегламентированногоУчета.Получить();

#КонецЕсли
